Documents/RequestXMLs/WebAPI SOAP Action_04_10_2017_17_54_30_8763fe92-3b4b-4fa2-a406-3b237ba887d8_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://services.uscellular.com/schema/enterprise/messageheader/v1_0/types" xmlns:mes="http://services.uscellular.com/schema/enterprise/customer/customermanagement/v1_0/messages">
  <soapenv:Header>
    <typ:MessageHeader>
      <typ:clientId>dpUser</typ:clientId>
      <typ:uscSecurityToken>cGFzc3dvcmQ=</typ:uscSecurityToken>
    </typ:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <mes:getCustomerInfo_Request>
      <!--You have a CHOICE of the next 2 items at this level-->
      <mes:customerId>960049133</mes:customerId>
      <mes:pin>1234</mes:pin>
    </mes:getCustomerInfo_Request>
  </soapenv:Body>
</soapenv:Envelope>